{"pageProps":{"postData":{"id":"success","contentHtml":"<p>If you are reading this, I have successfully manage to deploy my website on <strong>Amazon S3 + CloudFront</strong>.</p>\n<p><img src=\"/images/breaking-free.png\" alt=\"free\"></p>\n<p>The shift to <strong>Amazon Web Services</strong> was a great decision. I’m now able to host my static websites for free and also get full CDN support.</p>\n<p>It was a bit challenging to switch from <strong>Next.js</strong> to a static S3 setup, but I’m sure this will be worth it in the long run. Learning that Next.js has a built-in static export feature was really awesome, and the process of generating the files turned out to be pretty straightforward.</p>\n<p>I first modified the <code>next.config.js</code> file as follows:</p>\n<pre><code class=\"language-js\">/** @type {import('next').NextConfig} */\r\nconst nextConfig = {\r\n  output: \"export\",\r\n  images: {\r\n    unoptimized: true,\r\n  },\r\n};\r\nmodule.exports = nextConfig;\n</code></pre>\n<p>Then, I ran the following command:</p>\n<p><code>pnpm build</code></p>\n<p>This generated all the static files inside the /out folder. From there, I just uploaded them to my S3 bucket and connected everything through a CloudFront distribution.</p>\n<h1><strong>Some Issues I Faced :</strong></h1>\n<h2>Invalidate the CloudFront Cache</h2>\n<p>to clear any cached errors,</p>\n<ol>\n<li>In your CloudFront distribution, click the Invalidations tab.</li>\n<li>Click Create invalidation.</li>\n<li>In the object paths field, enter /* to clear the cache for all files.</li>\n<li>Click Create invalidation.</li>\n</ol>\n<h2>Fix url mismatch</h2>\n<p>A mismatch between the \"clean\" URL your browser requests (/countdown) and the actual filename stored in your S3 bucket (countdown.html). When CloudFront receives the request for /countdown, it passes it directly to S3, which then correctly reports that it can't find an object with that exact name, resulting in the \"Access Denied\" error (because the object doesn't exist to be accessed).</p>\n<p>To fix this, Make a CloudFront Function Code</p>\n<ol>\n<li>In the AWS Console, navigate to CloudFront, then select Functions from the left-hand menu.</li>\n<li>Click on the name of the function you created (e.g., <code>url-rewrite-function</code>)</li>\n<li>Make sure the code in the editor is exactly this:</li>\n</ol>\n<pre><code>function handler(event) {\r\n  var request = event.request;\r\n  var uri = request.uri;\r\n\r\n  // Check whether the URI is missing a file name.\r\n  if (uri.endsWith('/')) {\r\n      request.uri += 'index.html';\r\n  }\r\n  // Check whether the URI is missing a file extension.\r\n  else if (!uri.includes('.')) {\r\n      request.uri += '.html';\r\n  }\r\n\r\n  return request;\r\n}\n</code></pre>\n<ol start=\"4\">\n<li>\n<p>Navigate back to your CloudFront distribution.</p>\n</li>\n<li>\n<p>Click on the Behaviors tab.</p>\n</li>\n<li>\n<p>Select the checkbox next to the behavior with the path pattern Default (*) and click Edit.</p>\n</li>\n<li>\n<p>Scroll down to the bottom to the Function associations section.</p>\n</li>\n<li>\n<p>Under Viewer request - Function type, ensure CloudFront Function is selected.</p>\n</li>\n<li>\n<p>Under Function ARN/Name, make sure the function you created (e.g., url-rewrite-function) is selected from the dropdown menu. It should look like this:</p>\n</li>\n<li>\n<p>Click Save changes.</p>\n</li>\n</ol>\n<p>The site should work flawlessly now!</p>\n<p>It was hard to update it since i have to keep doing the same steps everytime i make changes, But thats a problem for future me to fix :P</p>\n<p>Im sure ill learn about something until then, Ill leave here some links to help anyone who wants to do the same thing.</p>\n<p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/static-website-hosting.html\">https://docs.aws.amazon.com/AmazonS3/latest/userguide/static-website-hosting.html</a></p>\n<p><a href=\"https://nextjs.org/docs/pages/guides/static-exports\">How to create a static export of your Next.js application</a></p>\n<p>Thanks for reading the update!</p>\n","title":"Success","date":"2025-08-20"}},"__N_SSG":true}