{"pageProps":{"postData":{"id":"aws-day-one","contentHtml":"<p><img src=\"https://prod-assets.cosmic.aws.dev/a/31Ij0PVS5EItadUDGpkkiIiN003/free.webp\" alt=\"Setting Up Your AWS Free Tier Account\"></p>\n<p><a href=\"https://builder.aws.com/content/2lYwQJ47Sq8C76VkFUDisXB7VnN/secure-foundation-setting-up-your-aws-free-tier-account\">Link to the Article!</a></p>\n<p>I started the AWS Builder Challenge today. The first step was to set up an AWS Free Tier account and go through the initial security and billing precautions. The article made it sound like a 30-minute task, but in reality it took me much longer. There are many small steps, and each requires verifications, so it's not exactly quick.</p>\n<p>The guide itself was thorough, which helped. For someone new, it explains every click, so I didn't feel lost. What stood out was the emphasis on security. Setting up multi-factor authentication for the root account felt like a necessary reminder, too many people skip it otherwise.</p>\n<p>Creating an IAM user instead of working directly with the root account also made sense. I've seen cases where people accidentally cause problems by using root for everything, so I appreciated that the challenge included this early.</p>\n<p>There were some inconveniences. I needed to show more ID Proof, Payment verification only worked with credit or debit cards. As a college student, these felt unnecessary, especially when local payment options like UPI or netbanking would have been simpler and are supported by others.</p>\n<p>By the end of this step, I had my AWS account with MFA enabled, a separate IAM admin user for daily work, and a budget cap of $5 with alerts. The in-detail guide (credits to <a href=\"https://builder.aws.com/community/@ana\">Ana</a> for the wonderful guide ) made sure I didn’t miss anything, even if the process dragged longer than i wouldve liked.</p>\n<p>Overall it was a Great Article and Can't wait for more!</p>\n<p>Thanks for reading!</p>\n","title":"Day 1 of AWS Builder Challenge #2, \"Secure Foundation-Setting Up Your AWS Free Tier Account\" ","date":"2025-08-16"}},"__N_SSG":true}