{"pageProps":{"postData":{"id":"aws-day-five","contentHtml":"<p><img src=\"https://prod-assets.cosmic.aws.dev/a/31ZXZWyG4hafGKT1tJoh7zrCUkz/free.webp\" alt=\"Professional Deployment\"></p>\n<p><a href=\"https://builder.aws.com/content/31ZX81MJtym9PTFGBkPh42RbEsl/professional-deployment-github-amplify-and-modern-web-development\">Link to the Article!</a></p>\n<h3>Update to Success</h3>\n<p>If you read <a href=\"blog/posts/aws-day-five\">my previous post</a>, you’ll know I was dealing with the challenge of converting my Next.js project into static files and manually uploading them to S3 + CloudFront. Today’s article introduced <strong>Amazon Amplify</strong>, which removes all of that hassle.</p>\n<p>No more conversion scripts or manual uploads. Amplify connects directly to GitHub, builds the app, and deploys it automatically with every change. I even wrote a small <a href=\"https://github.com/Praneel7015/landing-page/blob/main/deploy.md\">deploy.md file</a> earlier to handle my manual workflow-but with Amplify, it’s no longer needed.</p>\n<p>Okay now Back to Day 5.</p>\n<h3>Day 5</h3>\n<p>This article really hit home because it solved the exact problem I ran into yesterday. I appreciated that it explained the basics clearly, including what Git and GitHub is, why they matter, and how to set up a repository. Even if you were completely new, you could follow along step by step.</p>\n<p>The big <strong>aha! moment</strong> was Amplify. Setting it up was straightforward: I tried deploying my static website, and it worked out of the box. To take it further, I customized error handling by adding a redirect rule for my custom 404 page:</p>\n<ol>\n<li>Under Hosting → Rewrites and Redirects, click \"Manage Redirects\"</li>\n<li>Change <code>\"target\": \"/index.html\"</code> to <code>\"target\": \"/404.html\"</code></li>\n<li>Click Save Changes</li>\n</ol>\n<p>Now my custom error page loads properly with no redirect issues.</p>\n<p>Looking back, I've realized how much I've grown as a developer since starting this journey. I'm glad I first went through the S3 + CloudFront manual setup. If I had gone straight to Amplify, I wouldn’t have learned about buckets, deployment scripts, or their limitations. That context makes me appreciate Amplify even more.</p>\n<p>For now, I won’t be deleting my manual setup, it feels wrong to remove it after everything we've been through. It deserves to stay.</p>\n<p><strong>Bonus</strong> :\r\nIn my next blog, I’ll explain how you can get a <strong>free domain</strong> (if you’re a student) using the GitHub Student Developer Pack to customize your site even further.</p>\n<h3>Checklist</h3>\n<ul>\n<li>[x] Created GitHub account and repository</li>\n<li>[x] Uploaded website files to GitHub</li>\n<li>[x] Deployed website using Amplify + GitHub integration</li>\n<li>[x] Tested automatic deployment with a code change</li>\n<li>[ ] Cleaned up original CloudFront distribution (intentionally skipped)</li>\n</ul>\n<p>Thanks for reading!</p>\n","title":"Day 5 – Professional Deployment with GitHub & Amplify","date":"2025-08-21"}},"__N_SSG":true}