{"pageProps":{"postData":{"id":"free-domain-with-github-studentpack","contentHtml":"<p>This guide provides a Step‑by‑step instructions to redeem a one‑year student domain (e.g., .me, .tech) via the GitHub Student Developer Pack and point it to your Amplify site.</p>\n<p><img src=\"https://media.giphy.com/media/v1.Y2lkPTc5MGI3NjExbjZ1MGhlbWd2YnIyeGFvb2J3OG15aXQycjFjeWI5N29ydW43dzV5bCZlcD12MV9naWZzX3NlYXJjaCZjdD1n/DffShiJ47fPqM/giphy.gif\" alt=\"YES\"></p>\n<p><strong>DISCLOSURE:</strong> I am not affiliated with Amazon, AWS, GitHub, .TECH, Namecheap, Name.com, or any related companies. This is a student guide based on publicly available information.</p>\n<h2>Who this is for?</h2>\n<p>This works if you're a current student and can verify your status for the GitHub Student Developer Pack. Verification typically requires two-factor authentication on your GitHub account and dated proof of enrollment.</p>\n<h2>What you'll do in this guide</h2>\n<ol>\n<li>Enroll in the GitHub Student Developer Pack.</li>\n<li>Filter the offers to “Domains” and pick a provider.</li>\n<li>Redeem a one-year domain.</li>\n<li>Connect that domain to your AWS Amplify app.</li>\n</ol>\n<blockquote>\n<p>Offers change over time and by region. Always review the current terms on the pack page before redeeming.</p>\n</blockquote>\n<h2>Step 1 : Enroll in the GitHub Student Developer Pack</h2>\n<ol>\n<li>Go to <a href=\"https://education.github.com/pack\">GitHub Student Developer Pack</a> and sign in with your GitHub account. If you haven’t enrolled before, follow the prompts to apply as a student.</li>\n<li>Ensure two-factor authentication (2FA) is enabled on your GitHub account. If you enable 2FA after applying, sign out and back in before reapplying.</li>\n<li>Submit dated student proof that clearly shows your name, school name, and current enrollment (ID, transcript, schedule, or enrollment letter).</li>\n</ol>\n<p>Approval can take time. You’ll see the offers once your status is verified.</p>\n<h2>Step 2 : Filter to domain offers</h2>\n<ol>\n<li>On the pack page, scroll to <strong>All offers</strong>.</li>\n<li>Use <strong>Filter: Domains</strong> to see providers such as:\n<ul>\n<li><strong>Namecheap</strong> - often includes a free <code>.me</code> domain for one year and SSL.</li>\n<li><strong>.TECH Domains</strong> - one free <code>.tech</code> domain for a year via the pack.</li>\n<li><strong>Name.com</strong> - student pricing for a range of TLDs with security add-ons.</li>\n</ul>\n</li>\n</ol>\n<p>Read each offer’s terms and renewal pricing; it’s free for the first year, then standard rates apply.</p>\n<h2>Step 3 : Redeem your domain</h2>\n<ol>\n<li>Click the offer link on the pack page and connect your GitHub account when prompted.</li>\n<li>Search for an available domain, add it to cart, and check out.</li>\n<li>Create a registrar account if needed and complete required contact details. Some providers require a payment method even for a free first year; that’s normal for domain ownership and renewals.</li>\n</ol>\n<p>Keep your registrar login handy you’ll need it to manage DNS.</p>\n<h2>Step 4 : Point the domain to AWS Amplify</h2>\n<p>You have two common paths. The exact screens can vary, so rely on the Amplify docs if wording changes.</p>\n<p><strong>Option A: Keep DNS at your registrar (add CNAME records)</strong></p>\n<ol>\n<li>In AWS Amplify Console, open your app → <strong>Hosting</strong> → <strong>Custom domains</strong> → <strong>Add domain</strong> and enter your root domain (example.com).</li>\n<li>Choose subdomains (for example, <code>www</code>), then view the DNS records Amplify shows you.</li>\n<li>In your registrar’s DNS settings, create the CNAMEs exactly as shown by Amplify. Propagation can take time.</li>\n</ol>\n<p><strong>PREFERED Option B: Move DNS to Route 53 (nameserver change)</strong></p>\n<ol>\n<li>Create a hosted zone in Route 53 for your domain and note the four NS records.</li>\n<li>At your registrar, replace their nameservers with the Route 53 nameservers.</li>\n<li>Back in Amplify, add the domain; Amplify can create the necessary records automatically.</li>\n</ol>\n<p>Amplify provisions HTTPS certificates and handles the CDN edge. If you get stuck, use the Amplify custom-domain guides and troubleshooting pages.</p>\n<h2>Notes on renewals and limits</h2>\n<ol>\n<li>Most student domain offers are free for the first year only; renewal is at standard registrar rates. Check your registrar dashboard for pricing and renewal dates.</li>\n<li>If your Student Pack eligibility lapses, your existing domain continues as long as you pay the registrar’s renewal price. The offer cannot usually be “re-redeemed.”</li>\n</ol>\n<p><strong>DISCLOSURE:</strong> I am not affiliated with Amazon, AWS, GitHub, .TECH, Namecheap, Name.com, or any related companies. This guide is informational only.</p>\n<p>Thanks for reading!</p>\n","title":"Get Your Free Domain with the GitHub Student Developer Pack (and connect it to AWS Amplify)","date":"2025-08-21"}},"__N_SSG":true}